Merge branch 'dev' of github.com:juspay/blend-design-system into 1058-avatar-components-code-refactor
